{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken","title":"Secret Unspoken","siteUrl":"https://secret-unspoken.github.io"}},"markdownRemark":{"html":"<p><em>Guest blogging for Secret Unspoken is Travis. Travis is a personal friend, and recovery partner. He is a husband and father of two, as well as being a business owner, and active leader in his church.</em></p>\n<hr>\n<h3>My story is not typical</h3>\n<p>Growing up I thought all the things happening to me were normal across the board for most kids.  I was sheltered from what was normal for many kids my age.  I grew up observing a world that would have seemed very strange indeed for many of my peers and even more peculiar for young people today. </p>\n<p>Absent father, distracted mother, disconnected siblings, poverty, excessive alcohol and TV, drugs, lack of routine and unhealthy family connections are easily linked to all sorts of psychological, spiritual and physiological problems.  These may have been present in the lives of many peers of mine growing up and are increasing in prevalence today but were completely lacking from my upbringing.</p>\n<p>My father was engaged in my life as a strong, wise, hardworking disciplined man who taught me to work hard, respect authority and love a family.  My mother was always present, giving up working outside the home to raise her four kids.  We always had plenty of money, were encouraged to earn for ourselves, be thrifty and there was no alcohol or drugs in our home.  Both my parents had quit destructive lifestyles when they became Christians shortly after I was born.  We had a solid routine for weekdays and a healthy time of rest on the weekends which was the only TV time of the week. We spent our free time playing outside and working around the house.  My extended family on both sides was large, warm and present often.  Other than some relatives with fringe destructive behaviour (that we really only found out about later) it was a great community.  Our church was large enough to have enough young people for me to enjoy Sunday school, kids clubs and youth groups in healthy community and develop lasting friendships.</p>\n<h3>My story is not typical but my problems were</h3>\n<p>I didn’t realize that this was not typical.  I thought everyone lived a “Leave it to Beaver” life except for some derelicts who had chosen to live on the streets of large cities in the US and Asia.  I had it great, with everything available that a kid could ask for.   I was married at age 21 to a beautiful girl and continued working in construction for my father on PEI before moving to Fredericton NB to get my B.Ed.</p>\n<p>I continued looking at pornograpy.  Of course I told myself that it wasn’t hurting anyone, it wasn’t affecting anyone else’s life and the behaviour got a little compartment in the back of my mind that only got open maybe once every day or two.  We had a good marriage, I had a stable life.  Nothing was imploding, it wasn’t sliding off the rails.  Sex became an issue though.You might say I was using my wife for my own pleasure. Once lying about hidden sexual behaviour became acceptable why couldn’t I lie about spending money etc…? Once lying snuck in I began to accept a lower level of “presence” with my wife and daughter.  I was still there but allowed my phone to suck away my attention, sleep to suck away my discipline and dishonesty to cloud my relationships with Jana, myself and God.</p>\n<p>My life had descended into a routine of dishonesty, distraction and stagnation.  I wasn’t happy about this lifestyle but accepted it as “life just not going the way you wanted”.  I was confused about Christianity which I had heard in sermons was a life of victory and peace.  I became a Christian at the age of 10 and followed a pretty moral path on the outside for sure but the victory and peace seemed elusive.  I experienced what Henry David Thoreau described when he said\n“the mass of men lead lives of quiet desperation”.</p>\n<h3>My problems were typical but my solution was not</h3>\n<p>After years of secretly living in acceptable shadows, a friend confronted me about my sexual behaviour.  He confessed his own struggles and told the story from which they had emerged.  While his story was vastly different than mine his problems were basically the same.  I repented.  That doesn’t mean I was or am perfect, not until heaven will that be the case.  Repentance is a change of mind.  I changed my mind about my behaviour.  It was destructive. It did affect people around me.  I couldn’t stop…I was addicted to porn. My lying had affected all areas of my life. I was an untrustworthy man.</p>\n<h3>What to do?</h3>\n<p>I accepted the friendship of men that had the same problems.  Finding these men is hard.  It’s not comfortable to talk about but so freeing.  A community of authentic men is one of the most freeing things I have found.  I confessed everything to my wife; hardest thing I’ve probably ever done.  They say you can only be fully loved as you’re fully known.  This is why everything begins with having no secrets.  Once there were no secrets, the lying in other areas faded (not disappeared…).  It is freeing to be loved for who you are, not for the avatar you create. </p>\n<p>My hope is that this can be the beginning of a solution for you.  If you’re willing to repent. To change your mind about what the lying and hiding is actually doing to you and those around you.  To draw near to a God who is truth and love, know that He will love you despite anything.  He has already made a way to come clean, to shuffle off the burden of lying and hiding.  Jesus, as a man, was perfect so we don’t have to be.  He was and is fully trustworthy so you don’t have to “achieve” an impossible standard to please God.  Find people who can walk this truth with you…peace and victory in all areas can be yours.</p>","frontmatter":{"title":"Secret Life and Acceptable Shadows","date":"2018-12-25","author":"Travis","description":"Telling the story of having a double life","banner":"https://unsplash.com/photos/UdzD5x_N8LA"},"fields":{"slug":"/posts/secret-life-and-acceptable-shadows/"},"wordCount":{"words":1005}}},"pageContext":{"slug":"/posts/secret-life-and-acceptable-shadows/","prev":{"frontmatter":{"type":"post","title":"We don't need accountability partners"},"fields":{"slug":"/posts/we-dont-need-accountability-partners/"}},"next":false}}