{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken"}},"markdownRemark":{"html":"<p>I've been asked how I have been working on my own recovery, and I get the sense that most people are listening for a silver bullet. I think the best way to answer this is to continue the story that I have been telling. I finished the <a href=\"https://secret-unspoken.github.io/posts/moving-on-and-getting-over/\">last post</a> with what I had learned coming away from <a href=\"https://faithfulandtrue.com/\">Faithful &#x26; True</a>, that I needed to work on the addiction directly, emotional and mental health, and on community. So how did I go about that?</p>\n<p>Let's start with the program. Similar to Alcoholics Anonymous' 12 steps, there are 7 steps to this program, which follow quite closely. There is no need to get into it, except to note that, like AA, there is no silver bullet to conquering the addiction. But following the program does yield results. At a high level, it involves admitting unmanageability and surrending control, accepting help from God as you understand him, accountability inside of community, reparations, and spreading hope to others.</p>\n<p>As far as working through the program, I spent my first 60 days in daily contact with another member. This is done for a few reasons. These first few days are challenging as you are adjusting from addiction-brain. Your brain needs a chance to physically change how it works off-drug, and daily accountability keeps you on-track. These daily meetings take a certain form that get you used to expressing what you are feeling, issues you are experiencing, and needs that others can help with. It felt a little contrived, to be honest, but the process did reveal a few things to me in short order:</p>\n<ol>\n<li>I was under-developed emotionally, and hardly able to identify what I was feeling beyond such basic words as <em>good</em>/<em>bad</em>.</li>\n<li>I was uncomfortable talking about my own issues.</li>\n<li>I found it difficult to express needs to other men.</li>\n</ol>\n<p>I know now that these 3 experiences are very common among men. If I could put man-culture into words (or \"machoism\"), it would be <em>I don't have feelings, nothing bothers me, and I don't need anything from anybody</em>.</p>\n<p>Let's start with the program: 12 step\nrussel brand\nfirst 60 days\nbiological: break from the stimulus\nmaking sense of my past\nunderstanding my own emotional history\nHow i learned to cope\nWhat I need to learn now to cope\nCommunity</p>","frontmatter":{"title":"Part Two: Recovery","date":"11 November, 2018"},"fields":{"slug":"/posts/recovery/"},"wordCount":{"words":388}}},"pageContext":{"slug":"/posts/recovery/","prev":{"frontmatter":{"type":"post","title":"Moving on and getting over"},"fields":{"slug":"/posts/moving-on-and-getting-over/"}},"next":false}}