{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken"}},"markdownRemark":{"html":"<p>So maybe you are having a private struggle but you are wondering if it is a <em>real</em> problem. With so much silence around the issue, and without anyone to share with, it is hard to tell and tough to be honest with ourselves; ultimately it is a question that we answer individually.</p>\n<p>When I asked the question for myself a few years ago, I went down this list<sup>1</sup> and had to admit that I was to the point of being stuck: </p>\n<ul>\n<li>Trying to stop repeatedly, and being unable to.</li>\n<li>Needing more, or progressing to worse behaviour to get the same effect.</li>\n<li>Developing a tolerance to the effect.</li>\n<li>Using the behaviour to manage emotional state. \"Medicating\" is often the term used when lowering your mood, but the behaviour can also be used to raise your mood. </li>\n<li>Persisting despite experiencing negative consequences.</li>\n</ul>\n<p>It is hard to admit that you might be stuck; there is a ton of shame around this issue that keeps men silent and keeps them from seeking help. But when you are stuck you need help, and there is help available. </p>\n<p>Personally, I had settled into a life of acceptance. It wasn't until a good friend shared his own story of sexual struggle, his drive to get help, and the freedom he was experiencing, that I decided life could be different for me. But it took honesty about my stuckness first. </p>\n<p>It is my hope to inspire you too. I'll be sharing more of my story soon on how I got help and how you can too. Stay tuned.</p>\n<p>Cheers!</p>\n<hr>\n<p>Resources:</p>\n<ul>\n<li><sup>1</sup> <em>Mark Laaser Ph.D.</em> (2013) Definitions: Addiction, of LIFE Recovery Guide For Men</li>\n</ul>","frontmatter":{"title":"Is it really a problem?","date":"18 October, 2018"},"fields":{"slug":"/posts/is-it-really-a-problem/"},"wordCount":{"words":275}}},"pageContext":{"slug":"/posts/is-it-really-a-problem/","prev":{"frontmatter":{"type":"post"},"fields":{"slug":"/posts/so-what-are-we-hiding-and-why/"}},"next":false}}