{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken","title":"Secret Unspoken","siteUrl":"https://secret-unspoken.github.io"}},"markdownRemark":{"html":"<p><em>Guest blogging for Secret Unspoken is Nikki. Nikki is my courageous partner and adventurer in life. She has experience on the issue as an affected spouse, and will be telling her own story from discovery throughout recovery. It is my hope that her story will bring spouses into the discussion, to challenge, inspire, and bring change into the lives of couples.</em></p>\n<hr>\n<p>When Nathan first asked me to guest write on his blog, I wasn’t really sure where to start. Recovery and addiction is such a broad and wide spectrum/topic and there are so many intricate details that go along with the journey, you don’t want to leave anything out. And how do you work it into conversations? “Hello, my husband is a sex addict.” Many people don’t even understand the terms, let alone why I chose to stay with all of the chaos, turmoil, and pain that comes from the unveiling of an addiction like this. </p>\n<h3>Where does a wife or woman even begin?</h3>\n<p>I’ll begin with this: I knew about Nathan’s issues with pornography right from the start of us dating. He had confided in me that he had struggles with this ever since he was a teen, but as we progressed in our relationship, I rarely saw this as a real problem. He seemed ok, he was functioning, he had a job, went to school, was active in his local church… he was the perfect man I was looking for. So what! if he had struggled with that. Most men do, I assumed, and therefore I put it out of my mind as a minor character flaw that I could work with, if the time ever came. </p>\n<p>As our marriage progressed I always felt there was something “off” but I could never put my finger on it. I didn’t have the proper words to describe what I felt was wrong, but I just had a gut feeling that our relationship wasn’t all it could be. But I continued on ad over time the distance started to feel like a chasm. It wasn’t until we started to talk about children that the issue started to become clearer in my mind; I started to pinpoint my feelings and began to realize that our relationship had not progressed as I expected. Nathan really wanted to start having children, and for some reason I just wasn’t. I knew I eventually wanted to be a mom, and I also felt like if we had a baby our relationship wouldn’t survive it. That was the thought that kept coming to my mind. And when I voiced this to him, he really took it to heart. I think this is when the thought of change started to take a hold in his mind. It's not that I didn’t want to have a baby, just not with him. </p>\n<h3>Resistance and Codependency</h3>\n<p>Fast forward to January 2016. Nathan had told me about his conversation with his friend who had struggled with sexual addiction and I could tell it really shook him. I didn’t quite fully understand the gravity of that conversation because I really hadn’t thought Nathan had an “addiction”. I had somehow convinced myself that this was just something men needed to do from time to time and that if I wasn’t available, then what could the harm be? Deep down, I didn’t like it, but again, this was the level of denial and surviving I was doing in order to just be with Nathan and not cause any rifts.  </p>\n<p>He then mentioned a conference in the states that could help him in the way he needed. I was pretty hesitant at first.</p>\n<ol>\n<li>How much would a weekend change a person, really? I was pretty skeptical. </li>\n<li>It was pretty pricey just for three days, plus the airfare and hotels. We just didn’t have the finances to pull it off. </li>\n</ol>\n<p>But Nathan was insistent. In fact, I had never seen him so sure and passionate about doing something that, so I thought that if he comes out of it with any sort of help for himself, maybe it’s not a bad idea. I agreed and off he went. </p>\n<p>When he came back after that weekend, I could sense a difference in him, but I didn’t quite understand what change I was seeing. The Nathan I knew was survivor Nathan. The Nathan that buried things, hid from issues, and was a very calm and logical person outwardly. This new person was (in my opinion) irrational, angered easily, overly sensitive and yet at peace with all these new and different emotions he was going through. I couldn’t make sense of it all. There were many new fights, sleepless nights, and tear-filled nights. And all i could think about is, \"and this guy wants to have kids with me? Now??\". He had to be insane. </p>\n<h3>Finding community</h3>\n<p>It wasn’t until I spoke with our friend’s wife that I realized I wasn’t alone. She was going through the same thing, only she had gone to the counterpart of the conference, aimed at the spouses of these men who had dealt (and were still dealing) with sexual addiction. There was a peace and turmoil in her that I didn’t understand but felt better that I wasn’t alone.   She suggested I go because it would not only help me understand the struggle that my husband was going through but it would be healing for me as well. I wasn’t sure what she meant, and quite frankly, my attitude was, this is his problem, not mine. I don’t need any healing or help. </p>\n<p>But, after much debate in my heart and head, I went. </p>\n<h3>The journey there and back again</h3>\n<p>When I first got there, I noticed the small, quaint room had boxes of tissues everywhere. I almost immediately got a pit in my stomach, wondering what I had signed up for here. As the weekend progressed, I learned there were many different women who were struggling to connect with their husbands in ways that I was, but were unable to because of this addiction. It was also here that I learned this addiction predated me. That it had nothing to do with me. It also taught me that I had a lot of bitterness, anger and resentment towards Nathan that I had buried for years. It also taught me the ideas that I had taught or told myself over the years and how I coped with those ideas. We had small groups where we shared our own histories and learned about our own expectations in our marriages, of ourselves and where they came from in relation to our upbringing and childhoods. It was astounding. I learned so many things about myself that I didn’t even know existed and I was able to develop the language that I so desperately needed to communicate to my husband that had been missing for years. </p>\n<p>When I came home, the first thing I did was hug my husband. I knew the journey would not be easy from here on out. I also knew it wouldn’t be all puppies and roses. Just because you can understand someone’s struggles doesn’t mean your human nature won’t creep back in and cause you to doubt your own thoughts and emotions. In the two years leading up to this blog, Nathan and I have been through individual counseling and marriage counseling to help heal those parts of our relationship that have been affected by the pain of addiction and how we BOTH coped with it. </p>\n<p>For me, whenever Nathan would \"act out\" or turn to his “drug”, the ideas or thoughts that I would have in order to cope were denial and apathy. But really what I was feeling was anger and resentment. Anger that he’s choose that over me, that he wouldn’t try and fix the problem or that he would try and hide from me. In his distance from me, I knew he had done something wrong; why couldn’t he just tell me? The ideas then that would follow this line of thought was that I was unworthy to be loved or cherished and I would cope by shopping (spending money that we didn’t have - which would always end in a fight) or I would wish for a different life. Now these things don’t sound so bad, but in reality, spending money that i knew we didn’t have would always set Nathan off and my thought life in wanting a different life was certainly not pure. And my apathy towards this made me almost numb to the pain I was causing myself in our marriage. In reaction to Nathan acting out, not only would these thoughts plague me but my attitude was unhelpful and dysfunctional. I would ice Nathan out and punish him by abstaining from any type of relationship; trying to make him feel my pain by giving him the cold shoulder to try and make him feel even more guilty for how he made me feel. This could go on for hours to days at a time. I thought i was justified in my behaviour. But all it did was push away the connection I so desperately wanted with my husband. </p>\n<p>Almost three years after going to this conference now, and my perspective on people has changed. I used to think that people were incapable of change. My cynicism knew no bounds when it came to people. I just had never seen true change demonstrated in way that was believable and lasting. Understand, both Nathan and I are not perfect now. We still struggle in going backwards to how we used to cope with problems. Believe me, this addiction can permeate through every aspect of your relationship and how you cope with issues with each other. And likewise the healing does not stop at just the behvaiour, but is something that filters into all areas of life.</p>\n<p>After all the pain and choas of the journey, I'm proud of the changes that my husband has made, and the sacrifice he has been willing to make to improve himself and our marriage.</p>","frontmatter":{"title":"From the other side","date":"2018-11-27","author":"Nicole","description":"Telling the story of addiction & recovery from the perspective of a spouse","banner":"https://unsplash.com/photos/CCjgYjUudxE"},"fields":{"slug":"/posts/from-the-other-side/"},"wordCount":{"words":1686}}},"pageContext":{"slug":"/posts/from-the-other-side/","prev":{"frontmatter":{"type":"post","title":"Part Two: Recovery"},"fields":{"slug":"/posts/recovery/"}},"next":{"frontmatter":{"type":"post","title":"We don't need accountability partners"},"fields":{"slug":"/posts/we-dont-need-accountability-partners/"}}}}