{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken","title":"Secret Unspoken","siteUrl":"https://secret-unspoken.github.io"}},"markdownRemark":{"html":"<p>I want to answer the question in the title by explaining the dynamic of the sexual struggle that so many share, and hopefully solidify why it ought to be talked about openly.</p>\n<p>On the homepage of the blog, I briefly mention the dynamic between shame, hiding, and the cycle of stuckness men often find themselves in. This is no new thing. Since the earliest records, men have been hiding in response to doing wrong. One only needs to read the record of Adam to know that when he did wrong, he was afraid and so he hid. It can be a terribly frightening thing to risk exposure to those around us when we feel we have done wrong. And that fear and drive to hide can be even more powerful when we not only feel we've done wrong, but that we <em>are</em> wrong. </p>\n<p>There is a difference between <em>shame</em> and <em>guilt</em>. <em>Guilt</em> is about a behaviour, but behaviours can change. <em>Shame</em> is a belief that touches on <em>who we are</em>. It is a belief that something is wrong with <em>me</em>. Deeper than that, shame is a belief that something is wrong with me that isn't also wrong with the <em>rest</em> of us. It is a failure to identify our failures as being part of the common human experience. It is a belief that nobody is as twisted and broken as I am.</p>\n<blockquote>\n<p>Shame... is a belief that nobody is as twisted and broken as I am.</p>\n</blockquote>\n<p>It is no wonder that men's sexual struggles are being met with silence, false transparency, and inexperience; so many men are still struggling silently, alone, and afraid to seek help. Paradoxically, I have found (and many others) that the making ourselves and our struggles known to other men in a safe community, is leading to less shame, more personal freedom, and stronger community.  </p>","frontmatter":{"title":"So what are we hiding and why?","date":"2018-10-13","author":null,"description":null,"banner":null},"fields":{"slug":"/posts/so-what-are-we-hiding-and-why/"},"wordCount":{"words":309}}},"pageContext":{"slug":"/posts/so-what-are-we-hiding-and-why/","prev":false,"next":{"frontmatter":{"type":"post","title":"Is it really a problem?"},"fields":{"slug":"/posts/is-it-really-a-problem/"}}}}