{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken"}},"markdownRemark":{"html":"<p>I've been asked how I have been working on my own recovery, and I get the sense that most people are listening for a silver bullet. I think the best way to answer this is to continue the story that I have been telling. I finished the <a href=\"/posts/moving-on-and-getting-over/\">last post</a> with what I had learned coming away from <a href=\"https://faithfulandtrue.com/\">Faithful &#x26; True</a>; I needed to work on the addiction directly, emotional and mental health, and on community. So how did I go about that?</p>\n<p>Let's start with the program. Similar to Alcoholics Anonymous' 12 steps, there are 7 steps to this program, which follow quite closely with AA. There is no need to get into it, except to note that, like AA, there is no silver bullet to conquering the addiction. But following the program does yield results. At a high level, it involves admitting unmanageability and surrending control, accepting help from God as you understand him and others, accountability inside of community, reparations, and spreading hope.</p>\n<blockquote>\n<p><em>Man-culture: I don't have feelings, nothing bothers me, and I don't need anything from anybody</em></p>\n</blockquote>\n<p>As far as working through the program, I spent my first 60 days in daily contact with another member. This is done for a few reasons. These first few days are challenging as you are adjusting from addiction-brain. Your brain needs a chance to physically change how it works off-drug, and daily accountability keeps you on-track. These daily meetings take a certain form that get you used to expressing what you are feeling, issues you are experiencing, and needs that others can help with. It felt a little contrived, to be honest, but the process did reveal a few things to me in short order:</p>\n<ol>\n<li>I was under-developed emotionally, and hardly able to identify what I was feeling beyond such basic words as <em>good</em> or <em>bad</em>.</li>\n<li>I was uncomfortable talking about my own issues.</li>\n<li>I found it difficult to express needs to other men.</li>\n</ol>\n<p>I know now that these 3 experiences are very common among men. If I could put man-culture (\"machoism\") into words it would be: <em>I don't have feelings, nothing bothers me, and I don't need anything from anybody</em>.</p>\n<p>I spent a good deal of the process delving into my past to understand how the addiction came about and why. As I tell the story in the <a href=\"/posts/moving-on-and-getting-over/\">previous post</a>, I had developed boy-ish ways of coping and burying feelings of loneliness and depression. For me to learn better ways, I had to spend some time studying my own past, and learning the story of how and why I became addicted. </p>\n<p>I shed a lot of tears thinking about my past. I didn't expect to find pain, but I did. And through the process, I came to terms with a lot beliefs I had about myself that the addiction had fueled, and found ways to change them. I am a healthier person today because of facing these issues. Moving towards my pain, and grieving losses proved to be one of the healthiest parts of this process. </p>\n<blockquote>\n<p><em>Addiction moves in cycles, and is fueled by your own woundedness. [...] the cycle goes on almost unconciously for many.</em></p>\n</blockquote>\n<p>Part of the program involves studying the dynamics of addiction. Addiction moves in cycles, and is fueled by your own woundedness. Moving between fantasy, ritual, acting out, and despair, the cycle goes on almost unconciously for many. Bringing this to the concious level, we studied our own justifications and entitlements, studying the path that lead us to trouble, defining our own sobriety, and drawing boundaries for ourselves. I have been asked privately about strategies for dealing with this, and while defining the addiction is part of that, the real work is in building the emotional maturity, personal awareness, and healthy community.</p>\n<p>All of this work was done within a safe community of other committed guys. And in so doing, we've built a tight-knit community together. </p>\n<hr>\n<p>So how about you?</p>\n<ol>\n<li>What does your community look like?</li>\n<li>Are you able to identify your highs and lows this week without using the words <em>good</em> or <em>bad</em>? If you cannot, why do you think that is?</li>\n<li>How has your experience of \"man-culture\" been similar or different?</li>\n</ol>\n<p>Comment below. See <a href=\"https://help.disqus.com/commenting/guest-commenting\">commenting as a guest</a>.</p>","frontmatter":{"title":"Part Two: Recovery","date":"11 November, 2018"},"fields":{"slug":"/posts/recovery/"},"wordCount":{"words":710}}},"pageContext":{"slug":"/posts/recovery/","prev":{"frontmatter":{"type":"post","title":"Moving on and getting over"},"fields":{"slug":"/posts/moving-on-and-getting-over/"}},"next":false}}