{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken","title":"Secret Unspoken","siteUrl":"https://secret-unspoken.github.io"}},"markdownRemark":{"html":"<p><em>Guest blogging for Secret Unspoken is Dan. Dan is a personal friend, and recovery partner, starting the recovery journey even before myself.</em></p>\n<hr>\n<p>It started when I was innocent and young. Mostly, it was finding innocent boyish comfort at night with my blanket, not quite knowing what was going on. This pattern that developed early transitioned at some point from nightly comfort to a way out of my feelings, a reward, or just something to do. By the time I was in my mid teens I couldn’t go a day without going for my vice, my drug of choice - pornographic, or other errotic fringe activities. When I moved out for University it only worsened further. As the behaviors continued in frequency, the shame of who I was as a whole and what I was doing only heightened. By the time I was 20 years old I believed that it could never stop - even if I wanted it to. </p>\n<p>I grew up in Christian family who went to church every Sunday. Sex was really a hush-hush subject that no one talked about, and the adults tip-toed around it as if it was something that was just down-right bad. So when I came to a point in my sexual addiction where I was terrified to have anyone find out, yet could not find a way to stop, I became more and more ashamed and stuffed it down and away - how could I be accepted when I was struggling with something that I knew as unacceptable?</p>\n<p>Throughout my teenage years my addiction continued to take root and intensify. I made countless efforts to stop on my own, but none worked. Whether it was sneaking on the computer or flipping through any magazines in the house, I seemed to find myself looking more and more for those photos that made my heart beat fast. Even after attempts to stop, because deep down I knew what I was doing was not healthy, it always came back, stronger and more shame-filled. </p>\n<p>After high school I moved away for University. I would be out of my parents house, often alone, and would have my own phone and computer with access to the the internet, filled with promigraphic and erotic photos. At this time I started to date my first girlfriend, who knew I had “manly struggles” but had no idea the truth and depth of my behaviors. This only added to my shame. As my years of University went on my sexual behaviors with errotic photos worsened. My lies to cover up my behaviors got more frequent, and my fear of being truly found out heightened. </p>\n<p>When I was in my fourth year of University an older and wiser friend, who I respect greatly, asked me to meet up at a coffee shop one day. That day was when my life truly began to change. That day at the coffee shop he explained his story of sexual addiction, and how he began down his own path of freedom and recovery from it - a story I would never of dreamed that he would have. </p>\n<p>I felt many different things that day. I felt comforted, that I was not alone in this. I felt scared, to tell people about parts of me and things I had done that I promised myself never to tell. </p>\n<p>Only two months after that day I attended the Faithful and True Men of Valor three day intensive workshop where I was given the chance to work with professionals and learn with fellow sex addicts about the roots of my own addiction. I was able to identify that pornographic and fringe behaviour were my way of escaping and numbing my feelings and hurts, and I realized that I could have hope that there is a way out. It is not the behavior itself, but the driving force behind it that needs to be addressed - yes, pornogrophy, or erotica, is destructive, but why do so many people choose it regardless? For everyone, the story is different, and the story is complicated. </p>\n<blockquote>\n<p>An addiction is trying to meet a legitimate need in an illegitimate way.</p>\n</blockquote>\n<p>Addiction comes when there is a human need that is not being met, and you find your own way of meeting it. In the words of an expert in the field of sexual addiction, “an addiction is trying to meet a legitimate need in an illegitimate way.” As I have come to learn more about myself and my story, I have realized that by this definition, I am an addict. Although I never wanted to tell anyone about who I was, the truth all along was that I was all of the things other people saw in me - a happy and easy-going guy, and I was also a hiding sex addict. Naming and exposing the truth of who I was did not negate who people thought I was, because, both were true. To this day, the most helpful, yet most simple, saying for me to remember is “whatever is true, is true.”</p>\n<blockquote>\n<p>At the core of recovery is being a true and honest person, who is able to expose the truth of who you are with safe and trusted people</p>\n</blockquote>\n<p>As a recovering sex addict, I cannot say that the drive to have a glimpse of my ‘drug’ has gone away - but with community amongst other sex addicts and being open and honest about who I truly am, I have found that power of this addiction diminish greatly. To admit it is an addiction and unmanageable is the first, yet hardest step, in recovering. At the core of recovery is being a true and honest person, who is able to expose the truth of who you are with safe and trusted people and to build relationships that go beyond the surface. With these types of open relationships and community you will start to identify and meet some of those human needs that were always there, but being met in illegitimate ways. </p>","frontmatter":{"title":"Legitimate Need, Illegitimate way","date":"2019-02-18","author":null,"description":null,"banner":null},"fields":{"slug":"/posts/legitimate-need-illegitimate-way/"},"wordCount":{"words":998}}},"pageContext":{"slug":"/posts/legitimate-need-illegitimate-way/","prev":{"frontmatter":{"type":"post","title":"Secret Life and Acceptable Shadows"},"fields":{"slug":"/posts/secret-life-and-acceptable-shadows/"}},"next":{"frontmatter":{"type":"post","title":"Developing a compassionate inner voice"},"fields":{"slug":"/posts/developing-a-compassionate-inner-voice/"}}}}