{"data":{"site":{"siteMetadata":{"shortname":"secret-unspoken","title":"Secret Unspoken","siteUrl":"https://secret-unspoken.github.io"}},"markdownRemark":{"html":"<p>If you have ever been part of a church that focused on sexual purity, then without a doubt, you have heard of <em>accountability partners</em>. You may have even had an accountability partner, or been a part of holding others accountable. What is an <em>accountability partner</em> exactly and what problem is it trying to solve?</p>\n<h3>What is an accountability partner?</h3>\n<p>In my experience, accountability partners are formed as part of men's group in a church dealing with the issue of sexual purity. Churches are aware and do attempt to deal with this issue from time to time, and this is often a part of it. I have also seen partners form organically from a couple concerned individuals who realize this is a problem and would like to do something about it.</p>\n<p>An accountability partner is someone with which you commit to staying open and honest about your own sexual purity. The idea is to bolster purity with a person to which you must confess should you transgress. Often these start well, but as time goes on, become less effective as partners stop reporting to each other. So what's wrong with this model?</p>\n<h3>White knuckling</h3>\n<p><em>White knuckling</em> is when you do your best to avoid the problematic behaviours without dealing with the underlying issues. It is so called because individuals must use sheer strength of will to stop. Inevitably, when the individual's resolve weakens, they give in and act out. The model that the churches use for <em>accountability partners</em> is flawed if only for this reason: person-to-person reporting alone is insufficient. </p>\n<h3>Shame partners</h3>\n<p>If I had my way, I would rename <em>accountability partners</em> to <em>shame partners</em>. This is because you develop a single-faceted relationship with your partner based on your failures. If all you do is report to someone when you fail, this person will come to represent your failure. Mostly like you will learn to avoid them, especially if they are not adept with understanding shame, and cannot help you explain and learn from your failures. </p>\n<blockquote>\n<p>If you behave badly, you are bad, and without transparent community, you are the only bad person you know</p>\n</blockquote>\n<p>As mentioned in a <a href=\"/posts/so-what-are-we-hiding-and-why\">previous post</a>, people stuck in sexual struggle often have issues with shame, and are unable to distinguish behaviour from identity. So if you behave badly, you are bad, and without transparent community, you are the only bad person you know, and so you hide for fear of discovery. That is the furthest thing from the truth. </p>\n<h3>Skin-deep model</h3>\n<p>Most of these young and older men have very little experience with long-lasting change. The model used for <em>accountability partners</em> makes no emphasis on emotional or driving issues. As such, the model is skin-deep, and yields superficial transparency and short-term results. </p>\n<p>In my experience, this model relies soley on <em>pressure</em> to succeed. The pressure comes from the fear of having to disclose your failures to your partner. The pressure might be augmented with shaming behaviour, in some circles. In my perception, churches or organizations that use this model do not know how to help others except by pressuring and shaming (if that is part of the culture as well).</p>\n<blockquote>\n<p>Shame is a powerful motivator [but] it is inadequate for long-term change. Why? Because when the feeling of shame wears off, so does the motivation.</p>\n</blockquote>\n<p>In the psychological community, it is well known that shame is not helpful (and actually counter-productive) to overcoming addiction. Join any AA group, or addictions group, and you will eventually see a chart similar to this:</p>\n<img src=\"http://i.imgur.com/gdkTHeM.jpg\" alt=\"\">\n<p>While shame is a powerful motivator, it is inadequate for long-term change. Why? Because when the <em>feeling</em> of shame wears off, so does the motivation to stay changed. Preoccupation and stress return, and the cycle continues. It is my belief that shame is a natural part of the human experience, but one must move past it to mature and change.</p>\n<h3>In over our heads</h3>\n<blockquote>\n<p>[Churches] could do better by emphasizing it (Scripture) as authoritative on the subjects it addresses, and leaving the rest alone. </p>\n</blockquote>\n<p>What churches need is an open mind and outside help. Many conservative church cultures are insular and laud the Bible and prayer as the only tools needed to tackle all of life's issues, human issues included. Church cultures err by proclaiming Scripture as the <em>only</em> source of truth; it could do better by emphasizing it as authoritative on the subjects it addresses, and leaving the rest alone. </p>\n<p>What the church is missing out on are the truths that the sciences can provide, particularly as they relate to emotional and psychological issues. With an open mind, churches are better positioned to accept outside help on this issue, and there are plenty of christian-flavoured people and services that can help.</p>\n<h3>Conclusion</h3>\n<p>We don't need accountability partners, but we do need accountability inside of a different community. That community needs to be committed to going beneath the surface to deal with this issue, needs the awareness to know when it lacks the depth to do so, and needs to be willing to seek outside help. </p>\n<p>We need a community of men that do more than just report failures to each other; we need groups of men who are willing to share issues and express needs, engaging each other on all of life's issues. What we need are life partners, not accountability partners. </p>\n<p>Lastly, we need to have an open mind to other sources of truth. This is a conundrum for many conservative Christians as they are accustomed to finding truth in the Bible only. For if a conservative Christian is open-minded enough to search for truth outside the Bible, how are they to know when they've found it? Let me suggest this to you: <strong>you will know you have found truth when it brings freedom into your life</strong>. After all, is that not the measuring stick for truth that is given to you: <em>\"and you will know the truth, and the truth will set you free\"</em>? </p>","frontmatter":{"title":"We don't need accountability partners","date":"2018-12-11","author":"Nathan","description":"Why the model is flawed and what can be done about it","banner":"https://unsplash.com/photos/PGnqT0rXWLs"},"fields":{"slug":"/posts/we-dont-need-accountability-partners/"},"wordCount":{"words":993}}},"pageContext":{"slug":"/posts/we-dont-need-accountability-partners/","prev":{"frontmatter":{"type":"post","title":"From the other side"},"fields":{"slug":"/posts/from-the-other-side/"}},"next":false}}